; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-13)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 )
(:init
(arm-empty)
(on b1 b10)
(on b2 b1)
(on b3 b4)
(on b4 b6)
(on b5 b9)
(on b6 b11)
(on b7 b8)
(on b8 b3)
(on b9 b7)
(on b10 b12)
(on-table b11)
(on b12 b13)
(on-table b13)
(clear b2)
(clear b5)
)
(:goal
(and
(on b1 b12)
(on b2 b10)
(on b3 b5)
(on b4 b8)
(on b5 b1)
(on b6 b4)
(on b9 b6)
(on b10 b11)
(on b11 b9)
(on b12 b13)
(on b13 b2))
)
)

; plan
1. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 1 of 11
2. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 11
3. (unstack b9 b7)
   deleted: (on b9 b7) (clear b9) (arm-empty)
   added: (holding b9) (clear b7)
   goals met: 1 of 11
4. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 11
5. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 1 of 11
6. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 11
7. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 1 of 11
8. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 11
9. (unstack b3 b4)
   deleted: (on b3 b4) (clear b3) (arm-empty)
   added: (holding b3) (clear b4)
   goals met: 1 of 11
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 11
11. (unstack b4 b6)
   deleted: (on b4 b6) (clear b4) (arm-empty)
   added: (holding b4) (clear b6)
   goals met: 1 of 11
12. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 2 of 11
13. (unstack b6 b11)
   deleted: (on b6 b11) (clear b6) (arm-empty)
   added: (holding b6) (clear b11)
   goals met: 2 of 11
14. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 3 of 11
15. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 3 of 11
16. (stack b9 b6)
   deleted: (clear b6) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b6)
   goals met: 4 of 11
17. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 4 of 11
18. (stack b11 b9)
   deleted: (clear b9) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b9)
   goals met: 5 of 11
19. (unstack b2 b1)
   deleted: (on b2 b1) (clear b2) (arm-empty)
   added: (holding b2) (clear b1)
   goals met: 5 of 11
20. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 11
21. (unstack b1 b10)
   deleted: (on b1 b10) (clear b1) (arm-empty)
   added: (holding b1) (clear b10)
   goals met: 5 of 11
22. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 11
23. (unstack b10 b12)
   deleted: (on b10 b12) (clear b10) (arm-empty)
   added: (holding b10) (clear b12)
   goals met: 5 of 11
24. (stack b10 b11)
   deleted: (clear b11) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b11)
   goals met: 6 of 11
25. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 11
26. (stack b2 b10)
   deleted: (clear b10) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b10)
   goals met: 7 of 11
27. (unstack b12 b13)
   deleted: (on b12 b13) (clear b12) (arm-empty)
   added: (holding b12) (clear b13)
   goals met: 6 of 11
28. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 6 of 11
29. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 6 of 11
30. (stack b13 b2)
   deleted: (clear b2) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b2)
   goals met: 7 of 11
31. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 7 of 11
32. (stack b12 b13)
   deleted: (clear b13) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b13)
   goals met: 8 of 11
33. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 8 of 11
34. (stack b1 b12)
   deleted: (clear b12) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b12)
   goals met: 9 of 11
35. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 9 of 11
36. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 10 of 11
37. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 10 of 11
38. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 11 of 11
